blog-posts/2004-12-01-another-recruit-for-the-wonderful-world-of-planner-hacking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Another recruit for the wonderful world of Planner hacking!</title>
<!-- 2014-04-30 Wed 17:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Another recruit for the wonderful world of Planner hacking!</h1>
<p>
December 1st, 2004 -
<a href="http://sachachua.com/blog/p/2452"><a href="http://sachachua.com/blog/p/2452">http://sachachua.com/blog/p/2452</a></a>
</p>

<p>
Chris Parsons wrote:
</p>

<blockquote>
<p>
Well, I was using the excellent new planner-create-note-from-task, and
 thought, “wouldn't it be nice to have the note optionally created on
the
 plan page rather than the (less useful) date page? I must ask Sacha
to
 do that.”
</p>

<p>
And then I thought, “No! I'll venture into the previously unchartered
 depths of lisp programming&#x2026; and work out how to do it myself.”
</p>

<p>
Here's my diff. Pass a prefix argument to always create on the plan
 page. Perhaps this should be the default &#x2013; Sacha's call, I guess.
</p>

<p>
Be gentle, it's my first proper lisp coding :)
</p>
</blockquote>

<p>
Wheeeeee! Another person discovered the joys of Emacs Lisp hacking!
</p>

<p>
See, Planner is easy to hack. =)
</p>

<p>
E-Mail from Chris Parsons
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
